# Задача 2: Найдите сумму цифр трехзначного числа.

number = input()

print(int(number[0]) + int(number[1]) + int(number[2]))
